Documents/ПереработкаОвощей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПереработкаОвощей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type><v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладИсточник</Name>
					<Type><v8:Type>cfg:CatalogRef.МестаХранения</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПриемник</Name>
					<Type><v8:Type>cfg:CatalogRef.МестаХранения</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type><v8:Type>cfg:CatalogRef.Пользователи</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers><v8:Length>0</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураСырье</Name>
							<Type><v8:Type>cfg:CatalogRef.Номенклатура</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСырье</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПродукция</Name>
							<Type><v8:Type>cfg:CatalogRef.Номенклатура</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПродукция</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПотерь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОпераций</Name>
							<Type><v8:Type>cfg:EnumRef.ВидыОперации</v8:Type></Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОпераций</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентаризация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мойка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Очистка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВакуумнаяУпаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпаковкаВПакет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПотерь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеИзлишков</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПереработкаОвощей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТовары.ВидОпераций) Тогда
			ВидОперации = Перечисления.ВидыОперации.Очистка;
		Иначе
			ВидОперации = СтрокаТовары.ВидОпераций;
		КонецЕсли;
		
		КоличествоПотерь = СтрокаТовары.КоличествоПотерь;
		Если Не ЗначениеЗаполнено(КоличествоПотерь) Тогда
			КоличествоПотерь = 0;
		КонецЕсли;
		
		КоличествоПродукции = СтрокаТовары.КоличествоПродукция;
		Если Не ЗначениеЗаполнено(КоличествоПродукции) Тогда
			КоличествоПродукции = СтрокаТовары.КоличествоСырье - КоличествоПотерь;
		КонецЕсли;
		
		Если КоличествоПродукции < 0 Тогда
			КоличествоПродукции = 0;
		КонецЕсли;
		
		// Расход сырья со склада-источника.
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = СкладИсточник;
		Движение.Номенклатура = СтрокаТовары.НоменклатураСырье;
		Движение.ВидОпераций = ВидОперации;
		Движение.Количество = СтрокаТовары.КоличествоСырье;
		
		// Приход готовой продукции на склад-приемник.
		Если КоличествоПродукции > 0 Тогда
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад = СкладПриемник;
			Движение.Номенклатура = СтрокаТовары.НоменклатураПродукция;
			Движение.ВидОпераций = ВидОперации;
			Движение.Количество = КоличествоПродукции;
		КонецЕсли;
		
		// Потери списываются как отдельная расходная операция.
		Если КоличествоПотерь > 0 Тогда
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = СкладИсточник;
			Движение.Номенклатура = СтрокаТовары.НоменклатураСырье;
			Движение.ВидОпераций = Перечисления.ВидыОперации.СписаниеПотерь;
			Движение.Количество = КоличествоПотерь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
